AntacidDT/ArpileCDF/sdkconfig.defaults
# Arpile 32CDF — default configuration for the Waveshare ESP32-P4 Nano
CONFIG_IDF_TARGET="esp32p4"

# Console / monitor
# Route app console over the on-chip USB-CDC (USB Serial/JTAG) so logs are
# visible on the board's USB-C (ttyACMx) without wiring external UART pins.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_BAUD_115200=y
CONFIG_ESPTOOLPY_MONITOR_BAUD_115200B=y

# Give the app task enough stack for SPI + display bring-up
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ_1000=y

# Disable external SPIRAM by default (Nano board has no PSRAM populated)
CONFIG_SPIRAM=n

# This Waveshare ESP32-P4 Nano is a pre-3.0 silicon part (chip rev 1.3).
# ESP-IDF treats <3.0 and >=3.0 as mutually exclusive; opt into the <3.0
# support path and set the minimum revision accordingly.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# USB Host stack (native ESP-IDF) for the Type-A OTG port (HID peripherals).
CONFIG_USB_HOST_HUBS_SUPPORTED=y

# WiFi via the onboard ESP32-C6 (esp-hosted over SDIO, host WiFi on P4).
# The C6 acts as the WiFi/BT radio slave; the P4 runs esp_hosted + esp_wifi_remote.
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# 16MB flash, custom partition table with large app (WiFi+BT stacks)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM (DOOM engine + WAD RAM image)
# NOTE: requires ESP-IDF 5.5 toolchain - the v6.0 bootloader fails to init
# this board's stacked hex PSRAM (verified on-device; v5.5 works).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Console on UART0 (board's CH343 programming port); USJ pins unused here
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
# Hosted SDIO buffers -> PSRAM-capable DMA; frees internal RAM squeezed by DOOM
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
